cilindro-vonKarman/Re40-2D-simpleFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         600;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{

	force
	{
		type        forces;
		libs        ("libforces.so");
	   	writeControl    timeStep;
	    	writeInterval   1;
		log         yes;
		patches     (cylinder);
		rho                 rhoInf;
        	rhoInf              1;
        	CofR                (0 0 0);
	}

	forceCoef
	{
	    	type            forceCoeffs;
	    	libs            ("libforces.so");
	    	writeControl    timeStep;
	    	writeInterval   1;
		log         yes;
		rho             rhoInf;      
    		rhoInf          1;          
	    	patches         (cylinder);
	    	liftDir         (0 1 0);
	    	dragDir         (1 0 0);
	    	CofR            (0 0 0);       
	    	pitchAxis       (0 0 1);
	    	magUInf         1;
	    	lRef            1;      //comp de referencia para calculo do Cm
	    	Aref            1;	//area projetada do cilindro  = D*Z            
	}
}
// ************************************************************************* //
